src/DataProcessors/Пр_ФормированиеПакетаДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>Пр_ФормированиеПакетаДокументов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВариантыВажности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыВажности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЗаданиеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаданиеНаРаботу</Name>
			<RegisterRecords>
				<xr:Item>InformationRegister.Пр_ПланФактовоеОтклонение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пр_Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_ОценкаВGitLab</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_ФактВGitLab</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КалендарьСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Заказчик</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Событие</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Тема</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/АктВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>АктВыполненныхРабот</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РаботыИУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/Пр_ФормированиеПакетаДокументов/Ext/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

// Формирует пакет документов для задания на работу
//
// Параметры:
// МассивДокументов - Массив
// 	* ДокументСсылка.ЗаданиеНаРаботу
//
Процедура СформироватьДокументы(МассивДокументов) Экспорт
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическое формирование документов'"),
							 УровеньЖурналаРегистрации.Информация,
							 Метаданные.Обработки.Пр_ФормированиеПакетаДокументов,,
							 НСтр("ru = 'Начало операции'"));
	
	Дата = ТекущаяДатаСеанса();
		
	ОсновнаяОрганизация = Справочники.Организации.ОрганизацияПоУмолчанию();
	ОсновнаяКасса = Справочники.Кассы.ПолучитьКассуПоУмолчанию(ОсновнаяОрганизация); 
    ОсновнаяВалюта = Константы.ВалютаУчета.Получить();
	ОсновнойБанковскийСчет = Справочники.БанковскиеСчета.БанковскийСчетСубъекта(ОсновнаяОрганизация, ОсновнаяВалюта);
	ВидСтавкиНДСПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнаяОрганизация, "ВидСтавкиНДСПоУмолчанию", Истина);
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	ТекущийСотрудник = РегистрыСведений.СотрудникиПользователя.ПолучитьСотрудниковПользователя(ТекущийПользователь)[0];
	ПодразделениеПрограммисты = Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию("Программисты");
	
	ОсновноеНалогообложение = НалогиУНФ.НалогообложениеНДС(ОсновнаяОрганизация,,Дата);
	ОсновнаяСтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ВидСтавкиНДСПоУмолчанию, Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", ОсновнаяВалюта);
	Запрос.УстановитьПараметр("Дата", Дата);
	ТЧРезультат = Запрос.Выполнить().Выгрузить();
	Если ТЧРезультат.Количество() Тогда
		ЗначенияВалюты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТЧРезультат[0]);	
	Иначе
		ЗначенияВалюты = Новый Структура("Курс, Кратность", 1, 1);	
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаданиеНаРаботуРаботы.Ссылка.Ссылка КАК ЗаданиеНаРаботу,
		|	ЗаданиеНаРаботуРаботы.Ссылка.Дата КАК Дата,
		|	ЗаданиеНаРаботуРаботы.Ссылка.Пр_Проект КАК Проект,
		|	ЗаданиеНаРаботуРаботы.Заказчик КАК Заказчик,
		|	ЗаданиеНаРаботуРаботы.Номенклатура КАК Номенклатура,
		|	ЗаданиеНаРаботуРаботы.Трудоемкость КАК Трудоемкость,
		|	ЗаданиеНаРаботуРаботы.Цена КАК Цена,
		|	ЗаданиеНаРаботуРаботы.Сумма КАК Сумма,
		|	Проекты.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.ЗаданиеНаРаботу.Работы КАК ЗаданиеНаРаботуРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО ЗаданиеНаРаботуРаботы.Ссылка.Пр_Проект = Проекты.Ссылка
		|ГДЕ
		|	ЗаданиеНаРаботуРаботы.Ссылка В(&МассивДокументов)
		|ИТОГИ ПО
		|	Контрагент";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);		
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
		
		ОсновнойДоговор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(ВыборкаКонтрагент.Контрагент);
		Выборка = ВыборкаКонтрагент.Выбрать();
		
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		Попытка                                    
			
			Событие = Документы.Событие.СоздатьДокумент();
			Событие.Дата = Дата;
			Событие.Автор = ТекущийПользователь;
			Событие.Важность = Перечисления.ВариантыВажности.Обычная; 
			Событие.Ответственный = ТекущийСотрудник;
			Событие.ТипСобытия = Перечисления.ТипыСобытий.Прочее;
			Событие.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.Событие;
			Событие.Тема = НСтр("ru = 'Автоматическое формирование документов. Разработка по часам'"); 
			Событие.Содержание = НСтр("ru = 'Разработка по часам'");
								 
			Событие.Состояние = Справочники.СостоянияСобытий.Завершено;
			
			СчетНаОплату = Документы.СчетНаОплату.СоздатьДокумент();
			СчетНаОплату.Дата = Дата;
			СчетНаОплату.Автор = ТекущийПользователь;
			СчетНаОплату.БанковскийСчет = ОсновнойБанковскийСчет;
			СчетНаОплату.ВалютаДокумента = ОсновнаяВалюта;
			СчетНаОплату.Договор = ОсновнойДоговор;
			СчетНаОплату.Касса = ОсновнаяКасса;
			СчетНаОплату.Комментарий = НСтр("ru = 'Создано автоматическим формированием документов'");
			СчетНаОплату.Контрагент = ВыборкаКонтрагент.Контрагент;
			СчетНаОплату.Курс = ЗначенияВалюты.Курс;
			СчетНаОплату.Кратность = ЗначенияВалюты.Кратность; 
			СчетНаОплату.НалогообложениеНДС = ОсновноеНалогообложение;
			СчетНаОплату.Организация = ОсновнаяОрганизация;
			СчетНаОплату.Ответственный = ТекущийСотрудник; 
			СчетНаОплату.Подразделение = ПодразделениеПрограммисты;
			СчетНаОплату.СуммаВключаетНДС = Истина;
			СчетНаОплату.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.СчетНаОплату;
			
			АктВыполненныхРабот = Документы.АктВыполненныхРабот.СоздатьДокумент();
			АктВыполненныхРабот.Дата = Дата;
			АктВыполненныхРабот.Автор = ТекущийПользователь;
			АктВыполненныхРабот.ВалютаДокумента = ОсновнаяВалюта;
			АктВыполненныхРабот.Договор = ОсновнойДоговор; 
			АктВыполненныхРабот.Комментарий = НСтр("ru = 'Создано автоматическим формированием документов'"); 
			АктВыполненныхРабот.Контрагент = ВыборкаКонтрагент.Контрагент;
			АктВыполненныхРабот.Курс = ЗначенияВалюты.Курс;
			АктВыполненныхРабот.Кратность = ЗначенияВалюты.Кратность;
			АктВыполненныхРабот.НалогообложениеНДС = ОсновноеНалогообложение;
			АктВыполненныхРабот.Организация = ОсновнаяОрганизация;
			АктВыполненныхРабот.Ответственный = ТекущийСотрудник;
			АктВыполненныхРабот.Подразделение = ПодразделениеПрограммисты;
			АктВыполненныхРабот.СуммаВключаетНДС = Истина;
			АктВыполненныхРабот.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.АктВыполненныхРабот;
			
			Пока Выборка.Следующий() Цикл 
				
				Попытка   
					
					ЗаданиеНаРаботуОбъект = Выборка.ЗаданиеНаРаботу.ПолучитьОбъект();
					Блокировка = Новый БлокировкаДанных;
					ЭлементБлокировки = Блокировка.Добавить("Документ.ЗаданиеНаРаботу");
					ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.ЗаданиеНаРаботу);
					ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
					Блокировка.Заблокировать();
					
					ЗаданиеНаРаботуОбъект.Состояние = Справочники.СостоянияСобытий.Завершено;
					ЗаданиеНаРаботуОбъект.Записать();
					
				Исключение  
					
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическое формирование документов'"),
											 УровеньЖурналаРегистрации.Ошибка,
											 Метаданные.Документы.ЗаданиеНаРаботу,
											 Выборка.ЗаданиеНаРаботу,
											 СтрШаблон(НСтр("ru = 'Объект был пропущен по причине: %1'"),
											 ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
					Продолжить;  
					
				КонецПопытки; 
				
				Событие.ДокументыОснования.Добавить().ДокументОснование = Выборка.ЗаданиеНаРаботу;
								
				СтрокаЗапасов = СчетНаОплату.Запасы.Добавить();
				СтрокаЗапасов.Номенклатура = Выборка.Номенклатура;
				СтрокаЗапасов.Количество = Выборка.Трудоемкость;
				СтрокаЗапасов.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ч;
				СтрокаЗапасов.Цена = Выборка.Цена;
				СтрокаЗапасов.СтавкаНДС = ОсновнаяСтавкаНДС;
				
				СтавкаНДСЧислом = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(ОсновнаяСтавкаНДС);
				СтрокаЗапасов.СуммаНДС = Выборка.Сумма * СтавкаНДСЧислом / 100;  
				СтрокаЗапасов.Сумма = Выборка.Сумма - СтрокаЗапасов.СуммаНДС;
				СтрокаЗапасов.Всего = Выборка.Сумма;
				
				НоваяРабота = АктВыполненныхРабот.РаботыИУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяРабота, СтрокаЗапасов);
				НоваяРабота.Проект = Выборка.Проект;
				
			КонецЦикла;
			
			Событие.Записать();
			СчетНаОплату.Событие = Событие.Ссылка;
			СчетНаОплату.Записать(РежимЗаписиДокумента.Проведение);
			
			АктВыполненныхРабот.ДокументОснование = СчетНаОплату.Ссылка; 
			АктВыполненныхРабот.ОснованиеПечатиСсылка = СчетНаОплату.Ссылка;	

			АктВыполненныхРабот.РаботыИУслуги.Свернуть("Номенклатура, Характеристика, ЕдиницаИзмерения, Цена, СтавкаНДС, Проект",
							 "Количество, Сумма, СуммаНДС, Всего");
			АктВыполненныхРабот.Записать(РежимЗаписиДокумента.Проведение);
			
			ЗафиксироватьТранзакцию(); 			

		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическое формирование документов'"),
									 УровеньЖурналаРегистрации.Ошибка,
									 Метаданные.Обработки.Пр_ФормированиеПакетаДокументов,,
									 СтрШаблон(НСтр("ru = 'Объект был пропущен по причине: %1'"),
									 ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			
		КонецПопытки;

		
	КонецЦикла;

	ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическое формирование документов'"),
							 УровеньЖурналаРегистрации.Информация,
							 Метаданные.Обработки.Пр_ФормированиеПакетаДокументов,,
							 НСтр("ru = 'Конец операции'"));

КонецПроцедуры

#КонецОбласти
